public class Homework3 {
    //Реализовать в Java следующую схему (в скобках свойства объектов)
    //У нас есть Дерево(возраст)
    //Деревья делятся на:
    //хвойные(имеют тип иголок)
    //лиственные(есть листья на дереве сейчас), умеют опадать (листья пропадают с дерева)
    //умеют цвести (листья появляются)
    //
    //Сосна и Ель являются хвойными.
    //для сосны характерен тип иголок - крупный
    //для ели характерен тип иголок - мелкий
    //
    //Береза является лиственным деревом.
    //Когда Береза цветет, помимо появления листьев, она источает аллергены (печать в консоль)
    //
    //Создать в методе ex1 сосну, березу, ель. Положить в массив.
    //Посчитать их средний возраст.
}

