public class Homework3 {
    //Задача: Фабрика телефонов
    //Создать 2 типа телефонов и комплектующих к ним.
    //При печати телефона должны показываться все свойства телефона и вложенных объектов.
    //1 тип: Samsung galaxy. Имеет операционную систему Android, плату j-108(размер (ширина Х длина Х высота) 10х12х13),
    //камеру Samsung(20x zoom).
    //2 Тип: Iphone 15. Имеет операционную систему Ios, плату 7uik(размер 15х12х13),
    //камеру iphone(15x zoom, есть вспышка).
    //
    //Создать фабрику, которая заполняет созданный телефон деталями
    //При создании телефона в нем нет комплектующих, как будто пустой пластиковый каркас,
    //но при этом модель телефона уже есть.
    //
    //
    //В фабрике должно быть два публичных метода с одним названием:
    //один будет собирать iphone, второй будет собирать samsung.
    //В данном методе создать два телефона, собрать их, распечатать.
}

