public class sss4 {
    //Создать пакет shop. Внутри пакета:
    //Создать класс Item (вещь). У вещи есть вес и наименование.
    //Создать класс Worker (работник). У работника есть: имя, возраст, пол(М/Ж), набор вещей.
    //Работник умеет хвастаться своими вещами: брать по очереди вещь, и кричать:
    //{Имя работника}: смотрите какая у меня вещь - {имя вещи}.
    //Создать класс Shop (магазин). У которого есть работники.
    //Магазин умеет печатать своих работников:
    //{Имя работника}: {возраст} лет, {мужчина или женщина}, список вещей: {набор вещей работника}
    //Создать класс Runner. В классе Runner:
    //Создать 4 вещи: молот (1000гр), отвертка(50гр), тетрадь(30гр), ручка(10гр)
    //Создать 2 работников:
    //-Василий,30 лет, мужчина, обладатель молота и отвертки.
    //-Марьяна,25 лет, женщина, обладательница тетради и ручки.
    //Создать магазин с работниками выше.
    //Вызвать у магазина печать.
    //Вызвать у каждого работника магазина хвастовство его вещами (достать работника из магазина).
}
